__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 1024, 1) 0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 256, 1024, 1) 0                                            
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 256, 1)   0           input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 64, 256, 1)   0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 256, 40)  10280       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 64, 256, 40)  10280       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 64, 40)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 16, 64, 40)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 16, 64, 40)   102440      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 64, 40)   102440      max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 4, 16, 40)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 4, 16, 40)    0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4, 16, 80)    0           max_pooling2d_5[0][0]            
                                                                 max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 4, 16, 30)    38430       concatenate_1[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1920)         0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          491776      flatten_1[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2)            514         dropout_1[0][0]                  
==================================================================================================
Total params: 756,160
Trainable params: 756,160
Non-trainable params: 0
__________________________________________________________________________________________________
